grevaillot/svd_tools/headers/ATSAM3X8H/pioc.h
/** @defgroup pioc_oer OER Output Enable Register
@{*/

/** PIOC_OER_P31 Output Enable **/
#define PIOC_OER_P31		(1 << 31)
/** PIOC_OER_P30 Output Enable **/
#define PIOC_OER_P30		(1 << 30)
/** PIOC_OER_P29 Output Enable **/
#define PIOC_OER_P29		(1 << 29)
/** PIOC_OER_P28 Output Enable **/
#define PIOC_OER_P28		(1 << 28)
/** PIOC_OER_P27 Output Enable **/
#define PIOC_OER_P27		(1 << 27)
/** PIOC_OER_P26 Output Enable **/
#define PIOC_OER_P26		(1 << 26)
/** PIOC_OER_P25 Output Enable **/
#define PIOC_OER_P25		(1 << 25)
/** PIOC_OER_P24 Output Enable **/
#define PIOC_OER_P24		(1 << 24)
/** PIOC_OER_P23 Output Enable **/
#define PIOC_OER_P23		(1 << 23)
/** PIOC_OER_P22 Output Enable **/
#define PIOC_OER_P22		(1 << 22)
/** PIOC_OER_P21 Output Enable **/
#define PIOC_OER_P21		(1 << 21)
/** PIOC_OER_P20 Output Enable **/
#define PIOC_OER_P20		(1 << 20)
/** PIOC_OER_P19 Output Enable **/
#define PIOC_OER_P19		(1 << 19)
/** PIOC_OER_P18 Output Enable **/
#define PIOC_OER_P18		(1 << 18)
/** PIOC_OER_P17 Output Enable **/
#define PIOC_OER_P17		(1 << 17)
/** PIOC_OER_P16 Output Enable **/
#define PIOC_OER_P16		(1 << 16)
/** PIOC_OER_P15 Output Enable **/
#define PIOC_OER_P15		(1 << 15)
/** PIOC_OER_P14 Output Enable **/
#define PIOC_OER_P14		(1 << 14)
/** PIOC_OER_P13 Output Enable **/
#define PIOC_OER_P13		(1 << 13)
/** PIOC_OER_P12 Output Enable **/
#define PIOC_OER_P12		(1 << 12)
/** PIOC_OER_P11 Output Enable **/
#define PIOC_OER_P11		(1 << 11)
/** PIOC_OER_P10 Output Enable **/
#define PIOC_OER_P10		(1 << 10)
/** PIOC_OER_P9 Output Enable **/
#define PIOC_OER_P9		(1 << 9)
/** PIOC_OER_P8 Output Enable **/
#define PIOC_OER_P8		(1 << 8)
/** PIOC_OER_P7 Output Enable **/
#define PIOC_OER_P7		(1 << 7)
/** PIOC_OER_P6 Output Enable **/
#define PIOC_OER_P6		(1 << 6)
/** PIOC_OER_P5 Output Enable **/
#define PIOC_OER_P5		(1 << 5)
/** PIOC_OER_P4 Output Enable **/
#define PIOC_OER_P4		(1 << 4)
/** PIOC_OER_P3 Output Enable **/
#define PIOC_OER_P3		(1 << 3)
/** PIOC_OER_P2 Output Enable **/
#define PIOC_OER_P2		(1 << 2)
/** PIOC_OER_P1 Output Enable **/
#define PIOC_OER_P1		(1 << 1)
/** PIOC_OER_P0 Output Enable **/
#define PIOC_OER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_odr ODR Output Disable Register
@{*/

/** PIOC_ODR_P31 Output Disable **/
#define PIOC_ODR_P31		(1 << 31)
/** PIOC_ODR_P30 Output Disable **/
#define PIOC_ODR_P30		(1 << 30)
/** PIOC_ODR_P29 Output Disable **/
#define PIOC_ODR_P29		(1 << 29)
/** PIOC_ODR_P28 Output Disable **/
#define PIOC_ODR_P28		(1 << 28)
/** PIOC_ODR_P27 Output Disable **/
#define PIOC_ODR_P27		(1 << 27)
/** PIOC_ODR_P26 Output Disable **/
#define PIOC_ODR_P26		(1 << 26)
/** PIOC_ODR_P25 Output Disable **/
#define PIOC_ODR_P25		(1 << 25)
/** PIOC_ODR_P24 Output Disable **/
#define PIOC_ODR_P24		(1 << 24)
/** PIOC_ODR_P23 Output Disable **/
#define PIOC_ODR_P23		(1 << 23)
/** PIOC_ODR_P22 Output Disable **/
#define PIOC_ODR_P22		(1 << 22)
/** PIOC_ODR_P21 Output Disable **/
#define PIOC_ODR_P21		(1 << 21)
/** PIOC_ODR_P20 Output Disable **/
#define PIOC_ODR_P20		(1 << 20)
/** PIOC_ODR_P19 Output Disable **/
#define PIOC_ODR_P19		(1 << 19)
/** PIOC_ODR_P18 Output Disable **/
#define PIOC_ODR_P18		(1 << 18)
/** PIOC_ODR_P17 Output Disable **/
#define PIOC_ODR_P17		(1 << 17)
/** PIOC_ODR_P16 Output Disable **/
#define PIOC_ODR_P16		(1 << 16)
/** PIOC_ODR_P15 Output Disable **/
#define PIOC_ODR_P15		(1 << 15)
/** PIOC_ODR_P14 Output Disable **/
#define PIOC_ODR_P14		(1 << 14)
/** PIOC_ODR_P13 Output Disable **/
#define PIOC_ODR_P13		(1 << 13)
/** PIOC_ODR_P12 Output Disable **/
#define PIOC_ODR_P12		(1 << 12)
/** PIOC_ODR_P11 Output Disable **/
#define PIOC_ODR_P11		(1 << 11)
/** PIOC_ODR_P10 Output Disable **/
#define PIOC_ODR_P10		(1 << 10)
/** PIOC_ODR_P9 Output Disable **/
#define PIOC_ODR_P9		(1 << 9)
/** PIOC_ODR_P8 Output Disable **/
#define PIOC_ODR_P8		(1 << 8)
/** PIOC_ODR_P7 Output Disable **/
#define PIOC_ODR_P7		(1 << 7)
/** PIOC_ODR_P6 Output Disable **/
#define PIOC_ODR_P6		(1 << 6)
/** PIOC_ODR_P5 Output Disable **/
#define PIOC_ODR_P5		(1 << 5)
/** PIOC_ODR_P4 Output Disable **/
#define PIOC_ODR_P4		(1 << 4)
/** PIOC_ODR_P3 Output Disable **/
#define PIOC_ODR_P3		(1 << 3)
/** PIOC_ODR_P2 Output Disable **/
#define PIOC_ODR_P2		(1 << 2)
/** PIOC_ODR_P1 Output Disable **/
#define PIOC_ODR_P1		(1 << 1)
/** PIOC_ODR_P0 Output Disable **/
#define PIOC_ODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_osr OSR Output Status Register
@{*/

/** PIOC_OSR_P31 Output Status **/
#define PIOC_OSR_P31		(1 << 31)
/** PIOC_OSR_P30 Output Status **/
#define PIOC_OSR_P30		(1 << 30)
/** PIOC_OSR_P29 Output Status **/
#define PIOC_OSR_P29		(1 << 29)
/** PIOC_OSR_P28 Output Status **/
#define PIOC_OSR_P28		(1 << 28)
/** PIOC_OSR_P27 Output Status **/
#define PIOC_OSR_P27		(1 << 27)
/** PIOC_OSR_P26 Output Status **/
#define PIOC_OSR_P26		(1 << 26)
/** PIOC_OSR_P25 Output Status **/
#define PIOC_OSR_P25		(1 << 25)
/** PIOC_OSR_P24 Output Status **/
#define PIOC_OSR_P24		(1 << 24)
/** PIOC_OSR_P23 Output Status **/
#define PIOC_OSR_P23		(1 << 23)
/** PIOC_OSR_P22 Output Status **/
#define PIOC_OSR_P22		(1 << 22)
/** PIOC_OSR_P21 Output Status **/
#define PIOC_OSR_P21		(1 << 21)
/** PIOC_OSR_P20 Output Status **/
#define PIOC_OSR_P20		(1 << 20)
/** PIOC_OSR_P19 Output Status **/
#define PIOC_OSR_P19		(1 << 19)
/** PIOC_OSR_P18 Output Status **/
#define PIOC_OSR_P18		(1 << 18)
/** PIOC_OSR_P17 Output Status **/
#define PIOC_OSR_P17		(1 << 17)
/** PIOC_OSR_P16 Output Status **/
#define PIOC_OSR_P16		(1 << 16)
/** PIOC_OSR_P15 Output Status **/
#define PIOC_OSR_P15		(1 << 15)
/** PIOC_OSR_P14 Output Status **/
#define PIOC_OSR_P14		(1 << 14)
/** PIOC_OSR_P13 Output Status **/
#define PIOC_OSR_P13		(1 << 13)
/** PIOC_OSR_P12 Output Status **/
#define PIOC_OSR_P12		(1 << 12)
/** PIOC_OSR_P11 Output Status **/
#define PIOC_OSR_P11		(1 << 11)
/** PIOC_OSR_P10 Output Status **/
#define PIOC_OSR_P10		(1 << 10)
/** PIOC_OSR_P9 Output Status **/
#define PIOC_OSR_P9		(1 << 9)
/** PIOC_OSR_P8 Output Status **/
#define PIOC_OSR_P8		(1 << 8)
/** PIOC_OSR_P7 Output Status **/
#define PIOC_OSR_P7		(1 << 7)
/** PIOC_OSR_P6 Output Status **/
#define PIOC_OSR_P6		(1 << 6)
/** PIOC_OSR_P5 Output Status **/
#define PIOC_OSR_P5		(1 << 5)
/** PIOC_OSR_P4 Output Status **/
#define PIOC_OSR_P4		(1 << 4)
/** PIOC_OSR_P3 Output Status **/
#define PIOC_OSR_P3		(1 << 3)
/** PIOC_OSR_P2 Output Status **/
#define PIOC_OSR_P2		(1 << 2)
/** PIOC_OSR_P1 Output Status **/
#define PIOC_OSR_P1		(1 << 1)
/** PIOC_OSR_P0 Output Status **/
#define PIOC_OSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifer IFER Glitch Input Filter Enable Register
@{*/

/** PIOC_IFER_P31 Input Filter Enable **/
#define PIOC_IFER_P31		(1 << 31)
/** PIOC_IFER_P30 Input Filter Enable **/
#define PIOC_IFER_P30		(1 << 30)
/** PIOC_IFER_P29 Input Filter Enable **/
#define PIOC_IFER_P29		(1 << 29)
/** PIOC_IFER_P28 Input Filter Enable **/
#define PIOC_IFER_P28		(1 << 28)
/** PIOC_IFER_P27 Input Filter Enable **/
#define PIOC_IFER_P27		(1 << 27)
/** PIOC_IFER_P26 Input Filter Enable **/
#define PIOC_IFER_P26		(1 << 26)
/** PIOC_IFER_P25 Input Filter Enable **/
#define PIOC_IFER_P25		(1 << 25)
/** PIOC_IFER_P24 Input Filter Enable **/
#define PIOC_IFER_P24		(1 << 24)
/** PIOC_IFER_P23 Input Filter Enable **/
#define PIOC_IFER_P23		(1 << 23)
/** PIOC_IFER_P22 Input Filter Enable **/
#define PIOC_IFER_P22		(1 << 22)
/** PIOC_IFER_P21 Input Filter Enable **/
#define PIOC_IFER_P21		(1 << 21)
/** PIOC_IFER_P20 Input Filter Enable **/
#define PIOC_IFER_P20		(1 << 20)
/** PIOC_IFER_P19 Input Filter Enable **/
#define PIOC_IFER_P19		(1 << 19)
/** PIOC_IFER_P18 Input Filter Enable **/
#define PIOC_IFER_P18		(1 << 18)
/** PIOC_IFER_P17 Input Filter Enable **/
#define PIOC_IFER_P17		(1 << 17)
/** PIOC_IFER_P16 Input Filter Enable **/
#define PIOC_IFER_P16		(1 << 16)
/** PIOC_IFER_P15 Input Filter Enable **/
#define PIOC_IFER_P15		(1 << 15)
/** PIOC_IFER_P14 Input Filter Enable **/
#define PIOC_IFER_P14		(1 << 14)
/** PIOC_IFER_P13 Input Filter Enable **/
#define PIOC_IFER_P13		(1 << 13)
/** PIOC_IFER_P12 Input Filter Enable **/
#define PIOC_IFER_P12		(1 << 12)
/** PIOC_IFER_P11 Input Filter Enable **/
#define PIOC_IFER_P11		(1 << 11)
/** PIOC_IFER_P10 Input Filter Enable **/
#define PIOC_IFER_P10		(1 << 10)
/** PIOC_IFER_P9 Input Filter Enable **/
#define PIOC_IFER_P9		(1 << 9)
/** PIOC_IFER_P8 Input Filter Enable **/
#define PIOC_IFER_P8		(1 << 8)
/** PIOC_IFER_P7 Input Filter Enable **/
#define PIOC_IFER_P7		(1 << 7)
/** PIOC_IFER_P6 Input Filter Enable **/
#define PIOC_IFER_P6		(1 << 6)
/** PIOC_IFER_P5 Input Filter Enable **/
#define PIOC_IFER_P5		(1 << 5)
/** PIOC_IFER_P4 Input Filter Enable **/
#define PIOC_IFER_P4		(1 << 4)
/** PIOC_IFER_P3 Input Filter Enable **/
#define PIOC_IFER_P3		(1 << 3)
/** PIOC_IFER_P2 Input Filter Enable **/
#define PIOC_IFER_P2		(1 << 2)
/** PIOC_IFER_P1 Input Filter Enable **/
#define PIOC_IFER_P1		(1 << 1)
/** PIOC_IFER_P0 Input Filter Enable **/
#define PIOC_IFER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifdr IFDR Glitch Input Filter Disable Register
@{*/

/** PIOC_IFDR_P31 Input Filter Disable **/
#define PIOC_IFDR_P31		(1 << 31)
/** PIOC_IFDR_P30 Input Filter Disable **/
#define PIOC_IFDR_P30		(1 << 30)
/** PIOC_IFDR_P29 Input Filter Disable **/
#define PIOC_IFDR_P29		(1 << 29)
/** PIOC_IFDR_P28 Input Filter Disable **/
#define PIOC_IFDR_P28		(1 << 28)
/** PIOC_IFDR_P27 Input Filter Disable **/
#define PIOC_IFDR_P27		(1 << 27)
/** PIOC_IFDR_P26 Input Filter Disable **/
#define PIOC_IFDR_P26		(1 << 26)
/** PIOC_IFDR_P25 Input Filter Disable **/
#define PIOC_IFDR_P25		(1 << 25)
/** PIOC_IFDR_P24 Input Filter Disable **/
#define PIOC_IFDR_P24		(1 << 24)
/** PIOC_IFDR_P23 Input Filter Disable **/
#define PIOC_IFDR_P23		(1 << 23)
/** PIOC_IFDR_P22 Input Filter Disable **/
#define PIOC_IFDR_P22		(1 << 22)
/** PIOC_IFDR_P21 Input Filter Disable **/
#define PIOC_IFDR_P21		(1 << 21)
/** PIOC_IFDR_P20 Input Filter Disable **/
#define PIOC_IFDR_P20		(1 << 20)
/** PIOC_IFDR_P19 Input Filter Disable **/
#define PIOC_IFDR_P19		(1 << 19)
/** PIOC_IFDR_P18 Input Filter Disable **/
#define PIOC_IFDR_P18		(1 << 18)
/** PIOC_IFDR_P17 Input Filter Disable **/
#define PIOC_IFDR_P17		(1 << 17)
/** PIOC_IFDR_P16 Input Filter Disable **/
#define PIOC_IFDR_P16		(1 << 16)
/** PIOC_IFDR_P15 Input Filter Disable **/
#define PIOC_IFDR_P15		(1 << 15)
/** PIOC_IFDR_P14 Input Filter Disable **/
#define PIOC_IFDR_P14		(1 << 14)
/** PIOC_IFDR_P13 Input Filter Disable **/
#define PIOC_IFDR_P13		(1 << 13)
/** PIOC_IFDR_P12 Input Filter Disable **/
#define PIOC_IFDR_P12		(1 << 12)
/** PIOC_IFDR_P11 Input Filter Disable **/
#define PIOC_IFDR_P11		(1 << 11)
/** PIOC_IFDR_P10 Input Filter Disable **/
#define PIOC_IFDR_P10		(1 << 10)
/** PIOC_IFDR_P9 Input Filter Disable **/
#define PIOC_IFDR_P9		(1 << 9)
/** PIOC_IFDR_P8 Input Filter Disable **/
#define PIOC_IFDR_P8		(1 << 8)
/** PIOC_IFDR_P7 Input Filter Disable **/
#define PIOC_IFDR_P7		(1 << 7)
/** PIOC_IFDR_P6 Input Filter Disable **/
#define PIOC_IFDR_P6		(1 << 6)
/** PIOC_IFDR_P5 Input Filter Disable **/
#define PIOC_IFDR_P5		(1 << 5)
/** PIOC_IFDR_P4 Input Filter Disable **/
#define PIOC_IFDR_P4		(1 << 4)
/** PIOC_IFDR_P3 Input Filter Disable **/
#define PIOC_IFDR_P3		(1 << 3)
/** PIOC_IFDR_P2 Input Filter Disable **/
#define PIOC_IFDR_P2		(1 << 2)
/** PIOC_IFDR_P1 Input Filter Disable **/
#define PIOC_IFDR_P1		(1 << 1)
/** PIOC_IFDR_P0 Input Filter Disable **/
#define PIOC_IFDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifsr IFSR Glitch Input Filter Status Register
@{*/

/** PIOC_IFSR_P31 Input Filer Status **/
#define PIOC_IFSR_P31		(1 << 31)
/** PIOC_IFSR_P30 Input Filer Status **/
#define PIOC_IFSR_P30		(1 << 30)
/** PIOC_IFSR_P29 Input Filer Status **/
#define PIOC_IFSR_P29		(1 << 29)
/** PIOC_IFSR_P28 Input Filer Status **/
#define PIOC_IFSR_P28		(1 << 28)
/** PIOC_IFSR_P27 Input Filer Status **/
#define PIOC_IFSR_P27		(1 << 27)
/** PIOC_IFSR_P26 Input Filer Status **/
#define PIOC_IFSR_P26		(1 << 26)
/** PIOC_IFSR_P25 Input Filer Status **/
#define PIOC_IFSR_P25		(1 << 25)
/** PIOC_IFSR_P24 Input Filer Status **/
#define PIOC_IFSR_P24		(1 << 24)
/** PIOC_IFSR_P23 Input Filer Status **/
#define PIOC_IFSR_P23		(1 << 23)
/** PIOC_IFSR_P22 Input Filer Status **/
#define PIOC_IFSR_P22		(1 << 22)
/** PIOC_IFSR_P21 Input Filer Status **/
#define PIOC_IFSR_P21		(1 << 21)
/** PIOC_IFSR_P20 Input Filer Status **/
#define PIOC_IFSR_P20		(1 << 20)
/** PIOC_IFSR_P19 Input Filer Status **/
#define PIOC_IFSR_P19		(1 << 19)
/** PIOC_IFSR_P18 Input Filer Status **/
#define PIOC_IFSR_P18		(1 << 18)
/** PIOC_IFSR_P17 Input Filer Status **/
#define PIOC_IFSR_P17		(1 << 17)
/** PIOC_IFSR_P16 Input Filer Status **/
#define PIOC_IFSR_P16		(1 << 16)
/** PIOC_IFSR_P15 Input Filer Status **/
#define PIOC_IFSR_P15		(1 << 15)
/** PIOC_IFSR_P14 Input Filer Status **/
#define PIOC_IFSR_P14		(1 << 14)
/** PIOC_IFSR_P13 Input Filer Status **/
#define PIOC_IFSR_P13		(1 << 13)
/** PIOC_IFSR_P12 Input Filer Status **/
#define PIOC_IFSR_P12		(1 << 12)
/** PIOC_IFSR_P11 Input Filer Status **/
#define PIOC_IFSR_P11		(1 << 11)
/** PIOC_IFSR_P10 Input Filer Status **/
#define PIOC_IFSR_P10		(1 << 10)
/** PIOC_IFSR_P9 Input Filer Status **/
#define PIOC_IFSR_P9		(1 << 9)
/** PIOC_IFSR_P8 Input Filer Status **/
#define PIOC_IFSR_P8		(1 << 8)
/** PIOC_IFSR_P7 Input Filer Status **/
#define PIOC_IFSR_P7		(1 << 7)
/** PIOC_IFSR_P6 Input Filer Status **/
#define PIOC_IFSR_P6		(1 << 6)
/** PIOC_IFSR_P5 Input Filer Status **/
#define PIOC_IFSR_P5		(1 << 5)
/** PIOC_IFSR_P4 Input Filer Status **/
#define PIOC_IFSR_P4		(1 << 4)
/** PIOC_IFSR_P3 Input Filer Status **/
#define PIOC_IFSR_P3		(1 << 3)
/** PIOC_IFSR_P2 Input Filer Status **/
#define PIOC_IFSR_P2		(1 << 2)
/** PIOC_IFSR_P1 Input Filer Status **/
#define PIOC_IFSR_P1		(1 << 1)
/** PIOC_IFSR_P0 Input Filer Status **/
#define PIOC_IFSR_P0		(1 << 0)

/**@}*/

