grevaillot/svd_tools/headers/ATSAM3X8H/pioc.h
/** @defgroup pioc_absr ABSR Peripheral AB Select Register
@{*/

/** PIOC_ABSR_P31 Peripheral A Select. **/
#define PIOC_ABSR_P31		(1 << 31)
/** PIOC_ABSR_P30 Peripheral A Select. **/
#define PIOC_ABSR_P30		(1 << 30)
/** PIOC_ABSR_P29 Peripheral A Select. **/
#define PIOC_ABSR_P29		(1 << 29)
/** PIOC_ABSR_P28 Peripheral A Select. **/
#define PIOC_ABSR_P28		(1 << 28)
/** PIOC_ABSR_P27 Peripheral A Select. **/
#define PIOC_ABSR_P27		(1 << 27)
/** PIOC_ABSR_P26 Peripheral A Select. **/
#define PIOC_ABSR_P26		(1 << 26)
/** PIOC_ABSR_P25 Peripheral A Select. **/
#define PIOC_ABSR_P25		(1 << 25)
/** PIOC_ABSR_P24 Peripheral A Select. **/
#define PIOC_ABSR_P24		(1 << 24)
/** PIOC_ABSR_P23 Peripheral A Select. **/
#define PIOC_ABSR_P23		(1 << 23)
/** PIOC_ABSR_P22 Peripheral A Select. **/
#define PIOC_ABSR_P22		(1 << 22)
/** PIOC_ABSR_P21 Peripheral A Select. **/
#define PIOC_ABSR_P21		(1 << 21)
/** PIOC_ABSR_P20 Peripheral A Select. **/
#define PIOC_ABSR_P20		(1 << 20)
/** PIOC_ABSR_P19 Peripheral A Select. **/
#define PIOC_ABSR_P19		(1 << 19)
/** PIOC_ABSR_P18 Peripheral A Select. **/
#define PIOC_ABSR_P18		(1 << 18)
/** PIOC_ABSR_P17 Peripheral A Select. **/
#define PIOC_ABSR_P17		(1 << 17)
/** PIOC_ABSR_P16 Peripheral A Select. **/
#define PIOC_ABSR_P16		(1 << 16)
/** PIOC_ABSR_P15 Peripheral A Select. **/
#define PIOC_ABSR_P15		(1 << 15)
/** PIOC_ABSR_P14 Peripheral A Select. **/
#define PIOC_ABSR_P14		(1 << 14)
/** PIOC_ABSR_P13 Peripheral A Select. **/
#define PIOC_ABSR_P13		(1 << 13)
/** PIOC_ABSR_P12 Peripheral A Select. **/
#define PIOC_ABSR_P12		(1 << 12)
/** PIOC_ABSR_P11 Peripheral A Select. **/
#define PIOC_ABSR_P11		(1 << 11)
/** PIOC_ABSR_P10 Peripheral A Select. **/
#define PIOC_ABSR_P10		(1 << 10)
/** PIOC_ABSR_P9 Peripheral A Select. **/
#define PIOC_ABSR_P9		(1 << 9)
/** PIOC_ABSR_P8 Peripheral A Select. **/
#define PIOC_ABSR_P8		(1 << 8)
/** PIOC_ABSR_P7 Peripheral A Select. **/
#define PIOC_ABSR_P7		(1 << 7)
/** PIOC_ABSR_P6 Peripheral A Select. **/
#define PIOC_ABSR_P6		(1 << 6)
/** PIOC_ABSR_P5 Peripheral A Select. **/
#define PIOC_ABSR_P5		(1 << 5)
/** PIOC_ABSR_P4 Peripheral A Select. **/
#define PIOC_ABSR_P4		(1 << 4)
/** PIOC_ABSR_P3 Peripheral A Select. **/
#define PIOC_ABSR_P3		(1 << 3)
/** PIOC_ABSR_P2 Peripheral A Select. **/
#define PIOC_ABSR_P2		(1 << 2)
/** PIOC_ABSR_P1 Peripheral A Select. **/
#define PIOC_ABSR_P1		(1 << 1)
/** PIOC_ABSR_P0 Peripheral A Select. **/
#define PIOC_ABSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_scifsr SCIFSR System Clock Glitch Input Filter Select Register
@{*/

/** PIOC_SCIFSR_P31 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P31		(1 << 31)
/** PIOC_SCIFSR_P30 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P30		(1 << 30)
/** PIOC_SCIFSR_P29 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P29		(1 << 29)
/** PIOC_SCIFSR_P28 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P28		(1 << 28)
/** PIOC_SCIFSR_P27 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P27		(1 << 27)
/** PIOC_SCIFSR_P26 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P26		(1 << 26)
/** PIOC_SCIFSR_P25 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P25		(1 << 25)
/** PIOC_SCIFSR_P24 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P24		(1 << 24)
/** PIOC_SCIFSR_P23 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P23		(1 << 23)
/** PIOC_SCIFSR_P22 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P22		(1 << 22)
/** PIOC_SCIFSR_P21 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P21		(1 << 21)
/** PIOC_SCIFSR_P20 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P20		(1 << 20)
/** PIOC_SCIFSR_P19 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P19		(1 << 19)
/** PIOC_SCIFSR_P18 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P18		(1 << 18)
/** PIOC_SCIFSR_P17 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P17		(1 << 17)
/** PIOC_SCIFSR_P16 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P16		(1 << 16)
/** PIOC_SCIFSR_P15 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P15		(1 << 15)
/** PIOC_SCIFSR_P14 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P14		(1 << 14)
/** PIOC_SCIFSR_P13 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P13		(1 << 13)
/** PIOC_SCIFSR_P12 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P12		(1 << 12)
/** PIOC_SCIFSR_P11 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P11		(1 << 11)
/** PIOC_SCIFSR_P10 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P10		(1 << 10)
/** PIOC_SCIFSR_P9 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P9		(1 << 9)
/** PIOC_SCIFSR_P8 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P8		(1 << 8)
/** PIOC_SCIFSR_P7 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P7		(1 << 7)
/** PIOC_SCIFSR_P6 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P6		(1 << 6)
/** PIOC_SCIFSR_P5 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P5		(1 << 5)
/** PIOC_SCIFSR_P4 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P4		(1 << 4)
/** PIOC_SCIFSR_P3 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P3		(1 << 3)
/** PIOC_SCIFSR_P2 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P2		(1 << 2)
/** PIOC_SCIFSR_P1 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P1		(1 << 1)
/** PIOC_SCIFSR_P0 System Clock Glitch Filtering Select. **/
#define PIOC_SCIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_difsr DIFSR Debouncing Input Filter Select Register
@{*/

/** PIOC_DIFSR_P31 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P31		(1 << 31)
/** PIOC_DIFSR_P30 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P30		(1 << 30)
/** PIOC_DIFSR_P29 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P29		(1 << 29)
/** PIOC_DIFSR_P28 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P28		(1 << 28)
/** PIOC_DIFSR_P27 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P27		(1 << 27)
/** PIOC_DIFSR_P26 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P26		(1 << 26)
/** PIOC_DIFSR_P25 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P25		(1 << 25)
/** PIOC_DIFSR_P24 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P24		(1 << 24)
/** PIOC_DIFSR_P23 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P23		(1 << 23)
/** PIOC_DIFSR_P22 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P22		(1 << 22)
/** PIOC_DIFSR_P21 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P21		(1 << 21)
/** PIOC_DIFSR_P20 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P20		(1 << 20)
/** PIOC_DIFSR_P19 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P19		(1 << 19)
/** PIOC_DIFSR_P18 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P18		(1 << 18)
/** PIOC_DIFSR_P17 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P17		(1 << 17)
/** PIOC_DIFSR_P16 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P16		(1 << 16)
/** PIOC_DIFSR_P15 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P15		(1 << 15)
/** PIOC_DIFSR_P14 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P14		(1 << 14)
/** PIOC_DIFSR_P13 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P13		(1 << 13)
/** PIOC_DIFSR_P12 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P12		(1 << 12)
/** PIOC_DIFSR_P11 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P11		(1 << 11)
/** PIOC_DIFSR_P10 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P10		(1 << 10)
/** PIOC_DIFSR_P9 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P9		(1 << 9)
/** PIOC_DIFSR_P8 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P8		(1 << 8)
/** PIOC_DIFSR_P7 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P7		(1 << 7)
/** PIOC_DIFSR_P6 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P6		(1 << 6)
/** PIOC_DIFSR_P5 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P5		(1 << 5)
/** PIOC_DIFSR_P4 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P4		(1 << 4)
/** PIOC_DIFSR_P3 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P3		(1 << 3)
/** PIOC_DIFSR_P2 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P2		(1 << 2)
/** PIOC_DIFSR_P1 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P1		(1 << 1)
/** PIOC_DIFSR_P0 Debouncing Filtering Select. **/
#define PIOC_DIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifdgsr IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register
@{*/

