grevaillot/svd_tools/headers/ATSAM3X8H/pioc.h
/** PIOC_IFDGSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P31		(1 << 31)
/** PIOC_IFDGSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P30		(1 << 30)
/** PIOC_IFDGSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P29		(1 << 29)
/** PIOC_IFDGSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P28		(1 << 28)
/** PIOC_IFDGSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P27		(1 << 27)
/** PIOC_IFDGSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P26		(1 << 26)
/** PIOC_IFDGSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P25		(1 << 25)
/** PIOC_IFDGSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P24		(1 << 24)
/** PIOC_IFDGSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P23		(1 << 23)
/** PIOC_IFDGSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P22		(1 << 22)
/** PIOC_IFDGSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P21		(1 << 21)
/** PIOC_IFDGSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P20		(1 << 20)
/** PIOC_IFDGSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P19		(1 << 19)
/** PIOC_IFDGSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P18		(1 << 18)
/** PIOC_IFDGSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P17		(1 << 17)
/** PIOC_IFDGSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P16		(1 << 16)
/** PIOC_IFDGSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P15		(1 << 15)
/** PIOC_IFDGSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P14		(1 << 14)
/** PIOC_IFDGSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P13		(1 << 13)
/** PIOC_IFDGSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P12		(1 << 12)
/** PIOC_IFDGSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P11		(1 << 11)
/** PIOC_IFDGSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P10		(1 << 10)
/** PIOC_IFDGSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P9		(1 << 9)
/** PIOC_IFDGSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P8		(1 << 8)
/** PIOC_IFDGSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P7		(1 << 7)
/** PIOC_IFDGSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P6		(1 << 6)
/** PIOC_IFDGSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P5		(1 << 5)
/** PIOC_IFDGSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P4		(1 << 4)
/** PIOC_IFDGSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P3		(1 << 3)
/** PIOC_IFDGSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P2		(1 << 2)
/** PIOC_IFDGSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P1		(1 << 1)
/** PIOC_IFDGSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFDGSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOC_SCDR_DIV_SHIFT		0
#define PIOC_SCDR_DIV_MASK		0x3fff
/** @defgroup pioc_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

/** @defgroup pioc_ower OWER Output Write Enable
@{*/

/** PIOC_OWER_P31 Output Write Enable. **/
#define PIOC_OWER_P31		(1 << 31)
/** PIOC_OWER_P30 Output Write Enable. **/
#define PIOC_OWER_P30		(1 << 30)
/** PIOC_OWER_P29 Output Write Enable. **/
#define PIOC_OWER_P29		(1 << 29)
/** PIOC_OWER_P28 Output Write Enable. **/
#define PIOC_OWER_P28		(1 << 28)
/** PIOC_OWER_P27 Output Write Enable. **/
#define PIOC_OWER_P27		(1 << 27)
/** PIOC_OWER_P26 Output Write Enable. **/
#define PIOC_OWER_P26		(1 << 26)
/** PIOC_OWER_P25 Output Write Enable. **/
#define PIOC_OWER_P25		(1 << 25)
/** PIOC_OWER_P24 Output Write Enable. **/
#define PIOC_OWER_P24		(1 << 24)
/** PIOC_OWER_P23 Output Write Enable. **/
#define PIOC_OWER_P23		(1 << 23)
/** PIOC_OWER_P22 Output Write Enable. **/
#define PIOC_OWER_P22		(1 << 22)
/** PIOC_OWER_P21 Output Write Enable. **/
#define PIOC_OWER_P21		(1 << 21)
/** PIOC_OWER_P20 Output Write Enable. **/
#define PIOC_OWER_P20		(1 << 20)
/** PIOC_OWER_P19 Output Write Enable. **/
#define PIOC_OWER_P19		(1 << 19)
/** PIOC_OWER_P18 Output Write Enable. **/
#define PIOC_OWER_P18		(1 << 18)
/** PIOC_OWER_P17 Output Write Enable. **/
#define PIOC_OWER_P17		(1 << 17)
/** PIOC_OWER_P16 Output Write Enable. **/
#define PIOC_OWER_P16		(1 << 16)
/** PIOC_OWER_P15 Output Write Enable. **/
#define PIOC_OWER_P15		(1 << 15)
/** PIOC_OWER_P14 Output Write Enable. **/
#define PIOC_OWER_P14		(1 << 14)
/** PIOC_OWER_P13 Output Write Enable. **/
#define PIOC_OWER_P13		(1 << 13)
/** PIOC_OWER_P12 Output Write Enable. **/
#define PIOC_OWER_P12		(1 << 12)
/** PIOC_OWER_P11 Output Write Enable. **/
#define PIOC_OWER_P11		(1 << 11)
/** PIOC_OWER_P10 Output Write Enable. **/
#define PIOC_OWER_P10		(1 << 10)
/** PIOC_OWER_P9 Output Write Enable. **/
#define PIOC_OWER_P9		(1 << 9)
/** PIOC_OWER_P8 Output Write Enable. **/
#define PIOC_OWER_P8		(1 << 8)
/** PIOC_OWER_P7 Output Write Enable. **/
#define PIOC_OWER_P7		(1 << 7)
/** PIOC_OWER_P6 Output Write Enable. **/
#define PIOC_OWER_P6		(1 << 6)
/** PIOC_OWER_P5 Output Write Enable. **/
#define PIOC_OWER_P5		(1 << 5)
/** PIOC_OWER_P4 Output Write Enable. **/
#define PIOC_OWER_P4		(1 << 4)
/** PIOC_OWER_P3 Output Write Enable. **/
#define PIOC_OWER_P3		(1 << 3)
/** PIOC_OWER_P2 Output Write Enable. **/
#define PIOC_OWER_P2		(1 << 2)
/** PIOC_OWER_P1 Output Write Enable. **/
#define PIOC_OWER_P1		(1 << 1)
/** PIOC_OWER_P0 Output Write Enable. **/
#define PIOC_OWER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_owdr OWDR Output Write Disable
@{*/

/** PIOC_OWDR_P31 Output Write Disable. **/
#define PIOC_OWDR_P31		(1 << 31)
/** PIOC_OWDR_P30 Output Write Disable. **/
#define PIOC_OWDR_P30		(1 << 30)
/** PIOC_OWDR_P29 Output Write Disable. **/
#define PIOC_OWDR_P29		(1 << 29)
/** PIOC_OWDR_P28 Output Write Disable. **/
#define PIOC_OWDR_P28		(1 << 28)
/** PIOC_OWDR_P27 Output Write Disable. **/
#define PIOC_OWDR_P27		(1 << 27)
/** PIOC_OWDR_P26 Output Write Disable. **/
#define PIOC_OWDR_P26		(1 << 26)
/** PIOC_OWDR_P25 Output Write Disable. **/
#define PIOC_OWDR_P25		(1 << 25)
/** PIOC_OWDR_P24 Output Write Disable. **/
#define PIOC_OWDR_P24		(1 << 24)
/** PIOC_OWDR_P23 Output Write Disable. **/
#define PIOC_OWDR_P23		(1 << 23)
/** PIOC_OWDR_P22 Output Write Disable. **/
#define PIOC_OWDR_P22		(1 << 22)
/** PIOC_OWDR_P21 Output Write Disable. **/
#define PIOC_OWDR_P21		(1 << 21)
/** PIOC_OWDR_P20 Output Write Disable. **/
#define PIOC_OWDR_P20		(1 << 20)
/** PIOC_OWDR_P19 Output Write Disable. **/
#define PIOC_OWDR_P19		(1 << 19)
/** PIOC_OWDR_P18 Output Write Disable. **/
#define PIOC_OWDR_P18		(1 << 18)
/** PIOC_OWDR_P17 Output Write Disable. **/
#define PIOC_OWDR_P17		(1 << 17)
/** PIOC_OWDR_P16 Output Write Disable. **/
#define PIOC_OWDR_P16		(1 << 16)
/** PIOC_OWDR_P15 Output Write Disable. **/
#define PIOC_OWDR_P15		(1 << 15)
/** PIOC_OWDR_P14 Output Write Disable. **/
#define PIOC_OWDR_P14		(1 << 14)
/** PIOC_OWDR_P13 Output Write Disable. **/
#define PIOC_OWDR_P13		(1 << 13)
/** PIOC_OWDR_P12 Output Write Disable. **/
#define PIOC_OWDR_P12		(1 << 12)
/** PIOC_OWDR_P11 Output Write Disable. **/
#define PIOC_OWDR_P11		(1 << 11)
/** PIOC_OWDR_P10 Output Write Disable. **/
#define PIOC_OWDR_P10		(1 << 10)
/** PIOC_OWDR_P9 Output Write Disable. **/
#define PIOC_OWDR_P9		(1 << 9)
/** PIOC_OWDR_P8 Output Write Disable. **/
#define PIOC_OWDR_P8		(1 << 8)
/** PIOC_OWDR_P7 Output Write Disable. **/
#define PIOC_OWDR_P7		(1 << 7)
/** PIOC_OWDR_P6 Output Write Disable. **/
#define PIOC_OWDR_P6		(1 << 6)
/** PIOC_OWDR_P5 Output Write Disable. **/
#define PIOC_OWDR_P5		(1 << 5)
/** PIOC_OWDR_P4 Output Write Disable. **/
#define PIOC_OWDR_P4		(1 << 4)
/** PIOC_OWDR_P3 Output Write Disable. **/
#define PIOC_OWDR_P3		(1 << 3)
/** PIOC_OWDR_P2 Output Write Disable. **/
#define PIOC_OWDR_P2		(1 << 2)
/** PIOC_OWDR_P1 Output Write Disable. **/
#define PIOC_OWDR_P1		(1 << 1)
/** PIOC_OWDR_P0 Output Write Disable. **/
#define PIOC_OWDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_owsr OWSR Output Write Status Register
@{*/

